var gitlab = "https://gitlab.com/tjhirani";
var twitter = "https://www.twitter.com/tjhirani/";
var password = "tjhirani";
var linkedin = "https://www.linkedin.com/in/tjhirani";
var instagram = "https://www.instagram.com/tjhirani/";
var github = "https://github.com/tejas20002/";
var email = 'mailto:tejashirani55@gmail.com';
var domain = window.location.origin;
var t1 = domain+"/tutorial/t1/index.html";
var t2 = domain+"/tutorial/t2/";
var t4 = domain+"/tutorial/t4/index.html";
var t5 = domain+"/tutorial/t5/index.html";
var t6 = "http://hellodev.getenjoyment.net/t6/";
var t7 = "http://hellodev.getenjoyment.net/t7/";
var t8 = "http://hellodev.getenjoyment.net/t8/";
var t9 = "http://hellodev.getenjoyment.net/t9/";

whois = [
  "<br>",
  "Hey, I'm Tejas Hirani!👋",
  "I'm a Laravel Developer!!!",
  "After graduating with a Bachelor's in Computer Eng., I worked professionally",
  "as a software engineer building enterprise web applications for companies.",
  "the next generation of developers and help them navigate the crazy world that is software", 
  "development & computer eng..",
  "<br>"
];

social = [
  "<br>",
  'gitlab         <a href="' + gitlab + '" target="_blank">gitlab/tjhirani' + "</a>",
  'twitter        <a href="' + twitter + '" target="_blank">twitter/tjhirani' + '</a>',
  'linkedin       <a href="' + linkedin + '" target="_blank">linkedin/tjhirani' + "</a>",
  'instagram      <a href="' + instagram + '" target="_blank">instagram/tjhirani' + '</a>',
  'github         <a href="' + github + '" target="_blank">github/tejas20002' + "</a>",
  "<br>"
];

secret = [
  "<br>",
  '<span class="command">sudo</span>           Only use if you\'re admin',
  "<br>"
];

projects = [
  "<br>",
  'Tutorial 1         <a href="' + t1 + '" target="_blank">Tutorial 1 {Responsive Web Design}' + "</a>",
  'Tutorial 2         <a href="' + t2 + '" target="_blank">Tutorial 2 {Login and Registration Form}' + "</a>",
  'Tutorial 4         <a href="' + t4 + '" target="_blank">Tutorial 4 {JQuery Selector and Methods}' + "</a>",
  'Tutorial 5         <a href="' + t5 + '" target="_blank">Tutorial 5 {jQuery UI}' + "</a>",
  'Tutorial 7         <a href="' + t7 + '" target="_blank">Tutorial 7 {PHP}' + "</a>",
  'Tutorial 8         <a href="' + t8 + '" target="_blank">Tutorial 7 {PHP Looping Statements}' + "</a>",
  'Tutorial 9         <a href="' + t9 + '" target="_blank">Tutorial 9 {PHP}' + "</a>",
  "Still curating... most projects are offline, on GitHub, or confidential.",
  "<br>"
];

help = [
  "<br>",
  '<span class="command">profile</span>        TJHirani Personal Photo',
  '<span class="command">whois</span>          Who is TJHirani',
  '<span class="command">social</span>         Display social networks',
  '<span class="command">secret</span>         Find the password',
  '<span class="command">skill</span>          Skill of Tjhirani',
  '<span class="command">projects</span>       View coding projects',
  '<span class="command">history</span>        View command history',
  '<span class="command">help</span>           You obviously already know what this does',
  '<span class="command">email</span>          Do not email me',
  '<span class="command">banner</span>         Display the header',
  '<span class="command">clear</span>          Clear terminal',
  "<br>",
];

skill = [
  '<br>',
  '<span class="command">Php</span>           <a href="https://www.php.net/" target="_blank">PHP: Hypertext Preprocessor</a>',
  '<span class="command">Laravel</span>       <a href="https://laravel.com/" target="_blank">Laravel PHP web framework</a>',
  '<span class="command">Codeigniter</span>   <a href="https://codeigniter.com" target="_blank">Codeigniter PHP web framework</a>',
  '<span class="command">JavaScript</span>    <a href="https://www.javascript.com/" target="_blank">JavaScript</a>',
  '<span class="command">Android</span>       <a href="https://www.android.com/intl/en_in/" target="_blank">Android</a>',
  '<span class="command">Java</span>          <a href="https://www.java.com/" target="_blank">Java</a>',
  '<span class="command">MySQL</span>         <a href="https://www.mysql.com" target="_blank">MySQL</a>',
  '<span class="command">MariaDB</span>       <a href="https://mariadb.org/" target="_blank">MariaDB</a>',
  '<span class="command">Python</span>        <a href="https://www.python.org/" target="_blank">Python</a>',
  '<span class="command">Git</span>           <a href="https://git-scm.com/" target="_blank">Git</a>',
  '<span class="command">Github</span>        <a href="https://github.com/" target="_blank">Github</a>',
  '<span class="command">Docker</span>        <a href="https://www.docker.com/" target="_blank">Docker</a>',
  '<span class="command">Postman</span>       <a href="https://www.postman.com/" target="_blank">Postman</a>',
  '<span class="command">Linux</span>         <a href="https://www.linux.org/" target="_blank">Linux</a>',
  '<span class="command">Batch</span>         <a href="" target="_blank">Batch Script</a>',
  '<span class="command">Jenkins</span>       <a href="https://www.jenkins.io/" target="_blank">Jenkins</a>',
  '<span class="command">Composer</span>      <a href="https://getcomposer.org/" target="_blank">Composer</a>',
  '<br>'
];

banner = [
  '<span class="index">TJHirani (TJ) Not A Corporation. All TJ reserved.</span>',
  '██████╗  ██████╗ ██████╗ ███████╗██╗   ██╗███████╗',
  '██╔══██╗██╔═══██╗██╔══██╗██╔════╝╚██╗ ██╔╝██╔════╝',
  '██████╔╝██║   ██║██████╔╝█████╗   ╚████╔╝ █████╗  ',
  '██╔═══╝ ██║   ██║██╔═══╝ ██╔══╝    ╚██╔╝  ██╔══╝  ',
  '██║     ╚██████╔╝██║     ███████╗   ██║   ███████╗',
  '╚═╝      ╚═════╝ ╚═╝     ╚══════╝   ╚═╝   ╚══════╝',
  '<span class="color2">Welcome to my interactive web terminal.</span>',
  "<span class=\"color2\">For a list of available commands, type</span> <span class=\"command\">'help'</span><span class=\"color2\">.</span>",
];

profile = [
'  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣤⣤⣤⣶⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣤⣶⣾⣿⣟⣛⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣻⣿⣿⣻⣿⣿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣿⣿⣿⣿⣿⣧⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⣿⣿⣿⣿⠟⠉⠁⠀⠀⠓⠂⠀⠀⠀⠈⠙⢿⣿⣿⣿⣿⣿⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣿⣿⣿⣿⡿⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠈⢿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⢿⣾⠿⠿⣿⣿⣧⣤⡄⠀⠀⢀⣾⣿⣿⡿⠿⠿⣦⡛⢿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⡏⠟⠀⣤⣶⣶⣿⣶⣯⡉⠉⠀⢀⣵⣶⣶⣶⣶⣦⡈⠓⢸⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡖⢿⣿⡇⠀⠚⢿⣯⣿⡯⢽⣾⠟⠀⠐⢮⣧⠿⢽⣿⡿⠛⠃⠀⠘⣿⡟⢻⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣇⠈⣿⠀⠀⠀⠀⠀⠀⠄⠩⣯⠆⠀⠀⠀⢪⡙⠂⠠⠀⠀⠀⠀⠀⣿⣀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡘⢻⡇⠀⠀⠂⠀⠀⢀⣴⠛⡀⠀⠀⠛⠳⡍⠀⠀⠀⠀⠀⠀⣼⡟⢀⡼⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⠛⣷⡄⠀⠀⠀⠀⠈⠻⣬⣿⠶⢚⡻⠶⠃⠀⠀⠀⠀⠀⢰⣿⠛⣩⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢧⣽⡧⠀⠀⠀⣀⣤⣾⡿⠟⠃⠛⢿⣶⣤⣀⡀⠀⠀⠀⢨⡿⠤⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢳⠀⣄⠈⠿⠿⣖⡒⠛⠛⠛⠚⠲⠿⠿⠿⠀⡠⠀⣼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣇⠹⡆⠀⠀⠀⠉⠿⣿⡿⠛⠀⠀⠀⠀⠐⠁⣰⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⢄⣳⣄⡀⠀⠀⠀⢉⣁⡀⠀⠀⢀⣀⣶⣾⠋⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠻⣿⣿⣶⣿⣿⣾⣿⣦⣴⣾⣿⣿⡟⠁⠀⣧⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⠿⡄⠀⠈⠉⠛⠿⠿⠿⠯⡿⠿⠟⠋⠁⠀⠀⢀⡇⢹⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣴⣿⡄⠹⣄⠀⠠⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠏⠀⢸⣿⣦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣤⣶⣾⣿⣿⣿⣿⣿⣷⡀⠊⠳⣄⠈⠀⠀⠱⠄⠀⠀⠀⠀⠀⣰⠋⠀⠀⣾⣿⣿⣿⣿⣿⣷⣶⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⢴⣾⣿⣿⣿⣿⣿⡟⢛⣿⣿⣿⣿⣇⢦⡀⢈⡓⢦⡀⠀⠀⠀⠀⠀⢀⣼⢯⡀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣦⣄⡀⠀⠀⠀⠀⠀⠀⠀',
'⠀⠀⠀⠀⠀⣀⣤⣶⣟⣯⢥⣼⣟⠊⠙⠙⣿⣟⠁⣸⣿⣿⣿⣿⣿⡀⠙⢦⡑⣤⣉⠓⠒⢦⢀⡴⠋⠀⢹⡟⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣤⣄⡀⠀⠀',
'⠀⣀⣠⣴⣾⣿⣟⣿⣿⠏⠀⠁⠀⠀⠀⠀⢙⣿⠟⠋⣿⣿⣿⣿⣿⣷⠈⢾⡷⠄⠠⣄⣀⡸⠏⠄⠀⠀⠀⢻⢰⣿⣿⣿⣿⣿⣿⣿⣿⣥⢢⣉⠻⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦',
'⣾⣿⣿⣿⣟⣿⡿⠋⠁⡀⠀⠀⠀⠀⢀⣴⠟⠁⠀⠀⠙⢿⣿⣿⣿⣾⡆⠀⢹⡄⠀⠀⢸⠁⠀⠀⠀⠀⠀⠀⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⡯⠜⠀⠀⠉⠙⢛⢿⢿⣿⣿⣿⣿⣿⣿',
'⣿⣿⣿⣿⣿⡟⠂⠀⠀⠀⠀⠀⠀⠀⠸⣿⣄⠀⠀⠀⠐⣿⣿⣿⣿⣿⣿⠀⠘⠸⠀⠀⠈⠀⢨⡀⠀⠀⠀⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠀⠀⠀⠀⠀⠀⠈⣸⣿⣿⣿⣿⣿⣿',
'⣿⣿⣿⣿⣿⠅⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣦⡀⠀⠀⢿⣿⣿⣿⣿⣿⣇⠀⠀⡆⢀⠀⠀⠐⠀⠀⠀⠀⣸⣿⣿⣿⣿⣿⣿⣷⣿⡿⠁⠀⠀⠀⠀⠀⠀⠀⠐⣾⣿⣿⣿⣿⣿⣿',
'⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢷⣄⠀⠘⣿⣿⣿⣿⣿⣿⡄⠃⢣⠸⡄⠀⠀⢀⠀⠀⢀⣿⣿⣿⣿⣿⣿⣿⣿⣟⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿',
'⣿⣿⣿⣿⣿⣯⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢷⡀⢠⣿⣿⣿⣿⣿⣷⠀⠸⡄⠁⠀⠀⢸⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⡓⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿',
'⣿⣿⣿⣿⣿⣿⡔⠈⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣮⣿⣿⣿⣿⣿⣿⣇⠀⡇⠀⠀⣌⠉⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⣿⣿⣿⣿⣿⣿⣿',
'⣿⣿⣿⣿⣿⢿⣧⢰⢠⡶⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣷⣿⣿⣿⣿⣿⣿⡀⠁⢰⠀⢸⡀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿',
'⣿⣿⣿⣿⣿⡟⢻⣿⣯⣤⣂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢭⣾⣿⣿⣿⣿⣿⣿⣧⠀⢸⠀⠀⢇⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⡟⠃⠀⠀⠀⠀⠀⠀⠀⡄⣲⣛⣿⣿⣿⣿⣿⣿⣿',
'⣿⣿⣿⣿⣿⢵⣋⣿⣿⣿⣿⡄⠀⠀⠀⡀⠀⠀⠀⠀⠀⠐⠀⢹⣿⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⢸⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣛⠃⠀⠀⠀⠀⠀⠀⢀⣤⣾⣿⣿⣿⣿⣿⣿⣿⣿',
'⣿⣿⣿⣿⣏⣭⠇⢸⣿⣿⣿⣷⣤⣤⡀⠀⠀⠀⠀⠀⠀⠀⠈⣘⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⡈⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⡧⠀⠀⠀⠀⢀⣠⣄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿',
'⣿⣿⣿⣿⣿⣿⠀⢴⣿⣿⣿⣿⣦⣻⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⢿⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⣧⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠷⠄⠠⠰⢄⠒⠚⠻⢋⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿',
'⣿⣿⣿⣿⣿⣿⡀⢸⣿⣿⣿⣿⣿⣿⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⢀⣿⣿⣿⣿⣿⣿⣿⡇⠀⣻⣿⣿⣿⣿⣿⣿⣿⣿⣗⠁⠀⠀⠀⠀⠀⠀⠀⠀⢼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿',
'⣿⣿⣿⣿⣿⣿⠰⣾⣿⣿⣿⣿⣿⣿⣿⡯⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠿⣿⣿⣿⣿⣿⣿⣿⢀⣿⣿⣿⣿⣿⣿⣿⡿⣻⣃⣀⡀⡀⣀⡀⠤⣤⣴⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿',
'⣿⣿⣿⣿⣿⡿⢽⣿⣿⣿⣿⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠿⡿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⡓⠻⢏⠁⠀⠀⠀⠐⠘⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿',
];